app/Http/Controllers/Api/App/AppConfigController.php

    public function CustomerApp(Request $request)
    {
        $langs = BusinessSetting::where('key', 'system_language')->first();
        $countries = Country::where('status' , 1)->get();
        $banks = Bank::where('status' , 1)->get();
---
select * from `business_settings` where `key` = 'system_language' limit 1
select * from `countries` where `status` = 1
select * from `banks` where `status` = 1