app/Http/Controllers/Api/App/CartController.php

select * from `carts` where `user_id` = 8 and `is_guest` = 0
---
    public function get_carts(Request $request)
    {

        $user_id = auth('api')->id() ;
        $is_guest = 0;
        $carts = Cart::where('user_id', $user_id)->where('is_guest',$is_guest)->get()
        ->map(function ($data) {
            $data->add_on_ids = json_decode($data->add_on_ids,true);
            $data->add_on_qtys = json_decode($data->add_on_qtys,true);
            $data->variations = json_decode($data->variations,true);
			$data->item = Helpers::cart_product_data_formatting($data->item, $data->variations,$data->add_on_ids,
            $data->add_on_qtys, false, app()->getLocale());
			return $data;
		});