app/Http/Controllers/Api/App/HomeController.php

    public function home_page()
    {
        $user = auth('api')->user();
        $ads = [];
        //GET DEFAULT ADDRESS
        $address = CustomerAddress::where('user_id', $user->id)->first();
        if (isset($address)) {
            $zone = Zone::whereContains('coordinates', new Point($address->latitude, $address->longitude, POINT_SRID))->get();
            if (count($zone) == 0) {
                $errors = [];
                array_push($errors, ['code' => 'coordinates', 'message' => translate('messages.service_not_available_in_this_area')]);
                return response()->json([
                    'errors' => $errors
                ], 403);
            }

            $zoneIds = $zone->pluck('id')->toArray();
        }

        $restaurants = Restaurant::where('show_in_home_page',  1)->limit(10)->get();
        //get Near Restaurants
        $lng = $address->longitude;
        $lat = $address->latitude;
        $distance = 10; // kilometers
        $nearbyRestaurants = $restaurants->filter(function ($restaurant) use ($lng, $lat, $distance) {
            $restaurantDistance = $this->getDistanceToRestaurant($restaurant, $lat, $lng);
            return ($restaurantDistance <= $distance) && ($restaurantDistance != 0);
        })->map(function ($restaurant) use ($lat, $lng) {
            // Assuming getDeliveryTime is a method to calculate or retrieve delivery time
            $restaurant->delivery_time = $this->getDeliveryTime($restaurant, $lat, $lng);
            return $restaurant;
        });

        $categories = ZoneCategory::whereIn('zone_id', $zoneIds)->where('status' , 1)->get();
        $banners = Banner::where('status' , 1)->get();
---
select * from `customer_addresses` where `user_id` = 9 limit 1
select * from `zones` where ST_CONTAINS(`coordinates`, ST_GeomFromText('POINT(34.3421391 31.4150209)', 0))
select * from `restaurants` where `show_in_home_page` = 1 limit 10
select * from `zone_categories` where `zone_id` in (2) and `status` = 1
select * from `banners` where `status` = 1