app/Http/Controllers/Api/App/HomeController.php

    public function home_page(Request $request)
    {
        //areaId the app developer get it from Detector api
        $showMarkets = $request->ShowMarkets ?? false ;
        $areaId = $request->areaId ;

        //get Near Restaurants
        $longitude = $request->longitude ?? '0.0';
        $latitude = $request->latitude  ?? '0.0';

        $user = auth('api')->user();
        $ads = [];
        //GET DEFAULT ADDRESS
        // $address = CustomerAddress::where('user_id', $user->id)->where('is_default' , 1)->first();

        if ($areaId) {
            // $zone = Zone::whereContains('coordinates', new Point($address->latitude, $address->longitude, POINT_SRID))->get();
            // return $zone;
            $zone = Zone::where('id' , $areaId)->get();
            if (count($zone) == 0) {
                $errors = [];
                array_push($errors, ['code' => 'coordinates', 'message' => translate('messages.service_not_available_in_this_area')]);
                return response()->json([
                    'errors' => $errors
                ], 403);
            }
            $zoneIds = $zone->pluck('id')->toArray();


        }else{
            $zone = Zone::whereContains('coordinates' , new Point($latitude, $longitude, POINT_SRID))->get();
---
select * from `zones` where `id` = '2'
select * from `zones` where ST_CONTAINS(`coordinates`, ST_GeomFromText('POINT(35.7736 31.91576)', 0))

        });


        $categories = ZoneCategory::ForRestaurants()->whereIn('zone_id', $zoneIds)->where('status' , 1)->limit(10)->get();
        $banners = Banner::where('status' , 1)->get();
---
select * from `zone_categories` where `zone_id` in (4) and `status` = 1
select * from `banners` where `status` = 1

    public function market_home_page(Request $request)
    {
        //areaId the app developer get it from Detector api
        $showMarkets = $request->ShowMarkets ?? false ;
        $areaId = $request->areaId ;

        //get Near Restaurants
        $longitude = $request->longitude ?? '0.0';
        $latitude = $request->latitude  ?? '0.0';

        $user = auth('api')->user();
        $ads = [];
        //GET DEFAULT ADDRESS
        // $address = CustomerAddress::where('user_id', $user->id)->where('is_default' , 1)->first();

        if ($areaId) {
            // $zone = Zone::whereContains('coordinates', new Point($address->latitude, $address->longitude, POINT_SRID))->get();
            // return $zone;
            $zone = Zone::where('id' , $areaId)->get();
            if (count($zone) == 0) {
                $errors = [];
                array_push($errors, ['code' => 'coordinates', 'message' => translate('messages.service_not_available_in_this_area')]);
                return response()->json([
                    'errors' => $errors
                ], 403);
            }
            $zoneIds = $zone->pluck('id')->toArray();


        }else{
            $zone = Zone::whereContains('coordinates' , new Point($latitude, $longitude, POINT_SRID))->get();
---
select * from `zones` where ST_CONTAINS(`coordinates`, ST_GeomFromText('POINT(35.7736 31.91576)', 0))



        $categories = ZoneCategory::ForMarkets()->whereIn('zone_id', $zoneIds)->where('status' , 1)->limit(10)->get();
        $banners = Banner::where('status' , 1)->get();
---
select * from `banners` where `status` = 1