app/Http/Controllers/Api/App/HomeController.php

    public function show_partner($id)
    {
        $restaurant = Restaurant::where('id', $id)->first();
---
select * from `restaurants` where `id` = '4' limit 1