app/Http/Controllers/Api/App/OrderController.php

    public function place_order(Request $request)
    {
        $user = auth('api')->user();
        $validator = Validator::make($request->all(), [
            'order_amount' => 'required',
            'payment_method' => 'required|in:cash_on_delivery,digital_payment,wallet',
            'card_id' => 'required_if:payment_method,digital_payment',
            'order_type' => 'required|in:pick_up,delivery',
            'restaurant_id' => 'required',
            // 'distance' => 'required_if:order_type,delivery',
            'address' => 'required_if:order_type,delivery',
            // 'longitude' => 'required_if:order_type,delivery',
            // 'latitude' => 'required_if:order_type,delivery',
            'dm_tips' => 'nullable|numeric',
            'guest_id' =>   $user ? 'nullable' : 'required',
            'contact_person_name' =>   $user ? 'nullable' : 'required',
            'contact_person_number' =>   $user ? 'nullable' : 'required',
        ]);
        $foods = Food::whereIn('id' ,$request->items)->get();
---
select * from `food` where `id` in ('2', '1')

        $distance_data = $request->distance ?? 0;


        $home_delivery = BusinessSetting::where('key', 'home_delivery')->first()?->value ?? null;
---
select * from `business_settings` where `key` = 'home_delivery' limit 1

            ], 403);
        }

        $pick_up = BusinessSetting::where('key', 'pick_up')->first()?->value ?? null;
---
select * from `business_settings` where `key` = 'pick_up' limit 1

            ], 403);
        }

        $settings =  BusinessSetting::where('key', 'cash_on_delivery')->first();
---
select * from `business_settings` where `key` = 'cash_on_delivery' limit 1

                ]
            ], 406);
        }
        $restaurant = Restaurant::with(['discount', 'restaurant_sub'])->selectRaw('*, IF(((select count(*) from `restaurant_schedule` where `restaurants`.`id` = `restaurant_schedule`.`restaurant_id` and `restaurant_schedule`.`day` = ' . $schedule_at->format('w') . ' and `restaurant_schedule`.`opening_time` < "' . $schedule_at->format('H:i:s') . '" and `restaurant_schedule`.`closing_time` >"' . $schedule_at->format('H:i:s') . '") > 0), true, false) as open')->where('id', $request->restaurant_id)->first();
---
select * from `discounts` where `discounts`.`restaurant_id` in (1)

        //         $original_delivery_charge = $original_delivery_charge + $increased_fee;
        //     }
        // }
        $Defaddress = CustomerAddress::where('id' , $request->address)->first();
---
select * from `customer_addresses` where `id` = '2' limit 1

        // $order->schedule_at = $schedule_at;
        // $order->scheduled = $request->schedule_at?1:0;
        // $order->zone_id = $restaurant->zone_id;
        $dm_tips_manage_status = BusinessSetting::where('key', 'dm_tips_status')->first()->value;
---
select * from `business_settings` where `key` = 'dm_tips_status' limit 1


        // $total_price = $product_price + $total_addon_price - $restaurant_discount_amount ;
        $total_price = $request['order_amount'];
        $order->save();
---
insert into `orders` (`id`, `distance`, `user_id`, `order_amount`, `payment_status`, `order_status`, `coupon_code`, `payment_method`, `transaction_reference`, `order_note`, `order_type`, `restaurant_id`, `restaurant_discount_amount`, `delivery_address`, `dm_tips`, `pending`, `created_at`, `updated_at`, `delivery_instruction`, `tax_percentage`) values (100007, 0, 8, '220', 'paid', 'pending', '', 'wallet', '', 'test', 'delivery', '1', 0, '{\"contact_person_name\":\"amr amr\",\"contact_person_number\":null,\"contact_person_email\":\"\",\"address_type\":null,\"address\":\"PS ,GAZA , Dairalbalah\",\"floor\":null,\"road\":null,\"house\":null,\"longitude\":\"34.3421391\",\"latitude\":\"31.4150209\"}', 0, '2024-07-15 06:48:15', '2024-07-15 06:48:15', '2024-07-15 06:48:15', '', 10)


        foreach($foods as $key => $item)
        {
            $order_item = OrderItem::create([
                'order_id' => Order::find($order->id)->id,
                'item_id' => $item->id,
                'type' => get_class($item) ,
                'price' => $item->price,
                'quantity' => $request->items[$key]['quantity'],
                'discount' =>0,

                'total' => $item->price *  $request->items[$key]['quantity'],
                'action_type' => 1,
                'notes' => $item->notes,
            ]);
---
insert into `order_items` (`order_id`, `item_id`, `type`, `price`, `quantity`, `discount`, `total`, `action_type`, `notes`, `updated_at`, `created_at`) values (0, 1, 'App\Models\Food', 100, '2', 0, 200, 1, '', '2024-07-15 06:48:15', '2024-07-15 06:48:15')