app/Http/Controllers/Api/App/WalletController.php

insert into `card_accounts` (`token`, `last_4_digits`, `Tmonth`, `Tyear`, `brand`, `issuer`, `holder_name`, `holder_id`, `user_id`, `updated_at`, `created_at`) values ('6461828952794055614', '5614', '12', '2026', '1', '1', '', '', 8, '2024-07-15 01:33:54', '2024-07-15 01:33:54')
---
                    echo "Token not found in the string.";
                }

                CardAccount::create([
                    'token' => $token,
                    'last_4_digits' => $parsedData['L4digit'],
                    'Tmonth' => $parsedData['Tmonth'],
                    'Tyear' => $parsedData['Tyear'],
                    'brand' => $parsedData['Brand'],
                    'issuer' => $parsedData['Issuer'],
                    'user_id' => auth('api')->id(),
                ]);