app/Http/Controllers/Api/App/WalletController.php

    public function getCardAccounts()
    {
        $cards = CardAccount::select('number', 'expiry_date')->where('user_id', auth('api')->id())->get();
---
select `number`, `expiry_date` from `card_accounts` where `user_id` = 8