app/Http/Controllers/Api/App/WalletController.php

    public function SendMoney(Request $request)
    {
        $request->validate([
            'amount' => 'required',
            'phone' => 'required|exists:users,phone',
            'notice' => 'nullable',
        ]);

        if ($request->mobile == auth('api')->user()->mobile)
            return $this->FailedApi('you cannot send money to yourself', 422);

        $SenderWallet = CustomerWallet::where('user_id', auth('api')->id())->first();
        if ($SenderWallet->balance < $request->amount)
            return $this->FailedApi('The wallet balance not enough', 422);


        $Reciver = User::where('phone', $request->phone)->first();
        $ReciverWallet = CustomerWallet::where('user_id' , $Reciver->id)->first();



        $ReciverWallet->balance = $ReciverWallet->balance + $request->amount;
        $ReciverWallet->save();

        $SenderWallet->balance = $SenderWallet->balance - $request->amount;
        $SenderWallet->save();
---
select * from `customer_wallets` where `user_id` = 8 limit 1
select * from `users` where `phone` = '+972599450824' limit 1
update `customer_wallets` set `balance` = 70, `customer_wallets`.`updated_at` = '2024-06-28 03:10:52' where `id` = 4
update `customer_wallets` set `balance` = 30, `customer_wallets`.`updated_at` = '2024-06-28 03:10:52' where `id` = 3

    public function AddCard(Request $request)
    {
        $request->validate([
            'number' => 'required',
            'cvv' => 'required|min:3|max:3',
            'holder_name'=> 'required',
            'customer_id'=> 'required',
            'expiry_date' => 'required',
        ]);

        $request->merge([
            'user_id' => auth('api')->id(),
        ]);

        CardAccount::create($request->all());
---
insert into `card_accounts` (`number`, `cvv`, `holder_name`, `expiry_date`, `customer_id`, `user_id`, `updated_at`, `created_at`) values ('4222222222222', '744', 'AMER AMEEN YOUNIS', '26/06', '000', 8, '2024-06-28 03:41:39', '2024-06-28 03:41:39')