app/CentralLogics/helpers.php

select * from `business_settings` where (`key` = 'schedule_order') limit 1
---
    public static function schedule_order()
    {
        return (bool)BusinessSetting::where(['key' => 'schedule_order'])->first()?->value;

select `name` from `categories` where `id` = '1'
---
    public static function cart_product_data_formatting($data, $selected_variation, $selected_addons, $selected_addon_quantity,$trans = false, $local = 'en')
    {

        $variations = [];
        $categories = [];
        $selected_addons = ($selected_addons) ? $selected_addons : [] ;
        $selected_addon_quantity = ($selected_addon_quantity) ? $selected_addon_quantity : [] ;
        $category_ids = gettype($data['category_ids']) == 'array' ? $data['category_ids'] : json_decode($data['category_ids'],true);
        foreach ($category_ids as $value) {
            $category_name = Category::where('id',$value['id'])->pluck('name');

select * from `restaurants` where `restaurants`.`id` = 1 limit 1
select `cuisines`.*, `cuisine_restaurant`.`restaurant_id` as `pivot_restaurant_id`, `cuisine_restaurant`.`cuisine_id` as `pivot_cuisine_id` from `cuisines` inner join `cuisine_restaurant` on `cuisines`.`id` = `cuisine_restaurant`.`cuisine_id` where `cuisine_restaurant`.`restaurant_id` in (1)
---
        $data['min_delivery_time'] =  (int) explode('-',$data->restaurant->delivery_time)[0] ?? 0;
        $data['max_delivery_time'] =  (int) explode('-',$data->restaurant->delivery_time)[1] ?? 0;
        $cuisine =[];
        $cui =$data->restaurant->load('cuisine');

select * from `business_settings` where `key` = 'wallet_status' limit 1
---
    public static function get_business_settings($name, $json_decode = true)
    {
        $config = null;

        $paymentmethod = BusinessSetting::where('key', $name)->first();

select * from `business_settings` where (`key` = 'currency') limit 1
---
    public static function currency_code()
    {
        if (!config('currency') ){
            $currency = BusinessSetting::where(['key' => 'currency'])->first()?->value;

select * from `currencies` where (`currency_code` = 'USD') limit 1
---
    public static function currency_symbol()
    {
        if (!config('currency_symbol') ){
            $currency_symbol = Currency::where(['currency_code' => Helpers::currency_code()])->first()?->currency_symbol;

select * from `business_settings` where (`key` = 'currency_symbol_position') limit 1
---
    public static function format_currency($value)
    {
        if (!config('currency_symbol_position') ){
            $currency_symbol_position = BusinessSetting::where(['key' => 'currency_symbol_position'])->first()?->value;

select * from `business_settings` where (`key` = 'icon') limit 1
---
    public static function get_settings($name)
    {
        $config = null;
        $data = BusinessSetting::where(['key' => $name])->first();

select * from `business_settings` where `key` = 'business_model' limit 1
---
    public static function get_varient(array $product_variations, array $variations)
    {
        $result = [];
        $variation_price = 0;

        foreach($variations as $k=> $variation){
            foreach($product_variations as  $product_variation){
                if( isset($variation['values']) && isset($product_variation['values']) && $product_variation['name'] == $variation['name']  ){
                    $result[$k] = $product_variation;
                    $result[$k]['values'] = [];
                    foreach($product_variation['values'] as $key=> $option){
                        if(in_array($option['label'], $variation['values']['label'])){
                            $result[$k]['values'][] = $option;
                            $variation_price += $option['optionPrice'];
                        }
                    }
                }
            }
        }

        return ['price'=>$variation_price,'variations'=>array_values($result)];
      }




    public Static function subscription_check()
    {
        $business_model= BusinessSetting::where('key', 'business_model')->first();

select * from `business_settings` where `key` = 'system_language' limit 1
---
    public static function language_load()
    {
        if (\session()->has('language_settings')) {
            $language = \session('language_settings');
        } else {
            $language = BusinessSetting::where('key', 'system_language')->first();

select * from `vehicles` where `status` = 1 and (`starting_coverage_area` <= 0 and `maximum_coverage_area` >= 0 or (`starting_coverage_area` >= 0)) order by `starting_coverage_area` asc limit 1
---
    public static function vehicle_extra_charge(float $distance_data) {
        $data =[];
        $vehicle = Vehicle::active()
        ->where(function ($query) use ($distance_data) {
            $query->where('starting_coverage_area', '<=', $distance_data)->where('maximum_coverage_area', '>=', $distance_data)
            ->orWhere(function ($query) use ($distance_data) {
                $query->where('starting_coverage_area', '>=', $distance_data);
            });
        })->orderBy('starting_coverage_area')->first();

select * from `business_settings` where `key` = 'offline_payment_status' limit 1
---
    public static function get_mail_status($name)
    {
        return BusinessSetting::where('key', $name)->first()?->value ?? 0;

select * from `business_settings` where `key` = 'landing_integration_type' limit 1
---
        public static function get_business_data($name)
        {
            $paymentmethod = BusinessSetting::where('key', $name)->first();

insert into `translations` (`translationable_type`, `translationable_id`, `locale`, `key`, `value`) values ('App\Models\AddOn', 3, 'en', 'name', 'Test')
select * from `translations` where (`translationable_type` = 'App\Models\AddOn' and `translationable_id` = 3 and `locale` = 'en' and `key` = 'name') limit 1
---
        public static function add_or_update_translations($request, $key_data,$name_field ,$model_name, $data_id,$data_value ){
            try{
                $model = 'App\\Models\\'.$model_name;
                $default_lang = str_replace('_', '-', app()->getLocale());
                foreach ($request->lang as $index => $key) {
                    if ($default_lang == $key && !($request->{$name_field}[$index])) {
                        if ($key != 'default') {
                            Translation::updateorcreate(
                                [
                                    'translationable_type' =>  $model,
                                    'translationable_id' => $data_id,
                                    'locale' => $key,
                                    'key' => $key_data
                                ],
                                ['value' => $data_value]
                            );