app/Http/Controllers/Api/V1/LocationController.php

    public function CheckLocationsArea(Request $request)
    {
        $zone = Zone::whereContains('coordinates', new Point($request->latitude, $request->longitude, POINT_SRID))->get();
---
select * from `zones` where ST_CONTAINS(`coordinates`, ST_GeomFromText('POINT(34.3421391 31.4150209)', 0))