app/Http/Resources/Api/Transactions/TransactionResource.php

select * from `customer_wallet_transactions` where `id` = '13' limit 1
---
    public function toArray($request)
    {
        $movement_type = $this->movements_type;
        $transaction = $this;
        $relation = null;
        switch ($movement_type) {
            case 'user':
                if ($this->referance) {
                    $transaction = CustomerWalletTransaction::where('id', $this->referance)->first();