app/Http/Controllers/Admin/AddOnController.php

    public function getAddons()
    {
        $addons = AddOn::orderBy('name')->get();
---
select * from `add_ons` order by `name` asc

    public function store(Request $request)
    {
        $request->validate([
            'name.*' => 'max:191',
            'name'=>'array|required',
            'restaurant_id' => 'nullanle|numeric',
            'price' => 'required|numeric|between:0,999999999999.99',
            'name.0'=>'required',
        ], [
            'name.required' => translate('messages.Name is required!'),
            'restaurant_id.required' => translate('messages.please_select_restaurant'),
            'restaurant_id.numeric' => translate('messages.please_select_restaurant'),
            'name.0.required'=>translate('default_data_is_required'),
        ]);


        $addon = new AddOn();
        $addon->name = $request->name[array_search('default', $request->lang)];
        $addon->price = $request->price;
        $addon->stock_type = $request->stock_type;
        $addon->addon_stock = $request->stock_type != 'unlimited' ?  $request->addon_stock : 0;
        $addon->restaurant_id = $request->restaurant_id;
        $addon->save();
---
insert into `add_ons` (`name`, `price`, `stock_type`, `addon_stock`, `restaurant_id`, `updated_at`, `created_at`) values ('Test', '500', 'unlimited', 0, '', '2024-06-23 03:34:06', '2024-06-23 03:34:06')