app/Http/Controllers/Admin/CountryController.php

select * from `countries` order by `created_at` desc limit 1
select count(*) as aggregate from `countries` where (`name` like '%%')
---
    public function index(Request $request)
    {
        $key = explode(' ', $request['search'] ?? null);
        $countries = Country::withCount(['restaurants', 'deliverymen'])
            ->when(isset($key), function ($query) use ($key) {
                $query->where(function ($q) use ($key) {
                    foreach ($key as $value) {
                        $q->orWhere('name', 'like', "%{$value}%");
                    }
                });
            })
            ->latest()->paginate(config('default_pagination'));