app/Http/Controllers/Admin/DashboardController.php

    public function user_overview_calc($zone_id)
    {
        $params = session('dash_params');
        if(is_numeric($zone_id))
        {
            $customer = User::where('zone_id', $zone_id);
            $restaurants = Restaurant::where(['zone_id' => $zone_id])->wherehas('vendor', function($query) {
                return  $query->where('status' , 1);
            });
            $delivery_man = DeliveryMan::where('zone_id', $zone_id)->where('application_status' ,'approved')->Zonewise();
        }
        else
        {
            $customer = User::whereNotNull('id');
            $restaurants = Restaurant::whereNotNull('id')->wherehas('vendor', function($query) {
                return  $query->where('status' , 1);
            });
            $delivery_man = DeliveryMan::Zonewise()->where('application_status' ,'approved' );
        }
        //user overview
        if ($params['user_overview'] == 'overall') {
            $customer = $customer->count();
---
select count(*) as aggregate from `users` where `id` is not null

    public function dashboard_data()
    {
        $params = session('dash_params');
        $data_os = self::order_stats_calc($params['zone_id']);
        $data_uo = self::user_overview_calc($params['zone_id']);

        $popular = Wishlist::with(['restaurant'])
        ->whereHas('restaurant')
        ->when(is_numeric($params['zone_id']), function($q)use($params){
            return $q->whereHas('restaurant', function($query)use($params){
                return $query->where('zone_id', $params['zone_id']);
            });
        })
        ->select('restaurant_id', DB::raw('COUNT(restaurant_id) as count'))->groupBy('restaurant_id')->orderBy('count', 'DESC')->limit(12)->get();
        $top_sell = Food::withoutGlobalScopes([ZoneScope::class])
            ->when(is_numeric($params['zone_id']),function($q)use($params){
                return $q->whereHas('restaurant', function($query)use($params){
                    return $query->where('zone_id', $params['zone_id']);
                });
            })
            ->orderBy("order_count", 'desc')
            ->take(6)
            ->get();
        $top_rated_foods = Food::withoutGlobalScopes([ZoneScope::class])
            ->when(is_numeric($params['zone_id']),function($q)use($params){
                return $q->whereHas('restaurant', function($query)use($params){
                    return $query->where('zone_id', $params['zone_id']);
                });
            })
            ->where('avg_rating', '>', 0)
            ->orderBy('avg_rating','desc')
            ->orderBy('rating_count','desc')
            ->limit(6)
            ->get();
---
select `restaurant_id`, COUNT(restaurant_id) as count from `wishlists` where exists (select * from `restaurants` where `wishlists`.`restaurant_id` = `restaurants`.`id`) group by `restaurant_id` order by `count` desc limit 12
select * from `food` order by `order_count` desc limit 6
select * from `food` where `avg_rating` > 0 order by `avg_rating` desc, `rating_count` desc limit 6