app/Http/Controllers/Admin/FoodController.php

    public function index()
    {
        $categories = Category::where(['position' => 0])->get();
---
select * from `categories` where (`position` = 0)

    public function edit($id)
    {
        $product = Food::withoutGlobalScope(RestaurantScope::class)->withoutGlobalScope('translate')->with('translations')->findOrFail($id);

        if (!$product) {
            Toastr::error(translate('messages.food_not_found'));
            return back();
        }
        $product_category = json_decode($product->category_ids);
        $categories = Category::where(['parent_id' => 0])->get();
---
select * from `food` where `food`.`id` = '6' limit 1
select * from `categories` where (`parent_id` = 0)

    public function status(Request $request)
    {


        $id = $request->get('id');
        $info = Food::find($id);
---
select * from `food` where `food`.`id` is null limit 1

    public function get_categories(Request $request)
    {
        $cat = Category::where(['parent_id' => $request->parent_id])->get();
---
select * from `categories` where (`parent_id` is null)