app/Http/Controllers/Admin/MarketController.php

    public function index()
    {

        $page_data =   DataSetting::Where('type', 'market')->where('key', 'market_page_data')->first()?->value;
---
select * from `data_settings` where `type` = 'market' and `key` = 'market_page_data' limit 1