app/Http/Controllers/Admin/VendorController.php

    public function index()
    {

        $page_data=   DataSetting::Where('type' , 'restaurant')->where('key' , 'restaurant_page_data')->first()?->value;
---
select * from `data_settings` where `type` = 'restaurant' and `key` = 'restaurant_page_data' limit 1

    public function destroy(Request $request, Restaurant $restaurant)
    {
        if (env('APP_MODE') == 'demo' && $restaurant->id == 2) {
            Toastr::warning(translate('messages.you_can_not_delete_this_restaurant_please_add_a_new_restaurant_to_delete'));
            return back();
        }
        if (Storage::disk('public')->exists('restaurant/' . $restaurant['logo'])) {
            Storage::disk('public')->delete('restaurant/' . $restaurant['logo']);
        }
        $vendor = Vendor::findOrFail($restaurant?->vendor?->id);
---
select * from `vendors` where `vendors`.`id` = 1 limit 1

    public function view($restaurant,Request $request, $tab = null, $sub_tab = 'cash')
    {
        $key = explode(' ', $request['search']);

        $restaurant= Restaurant::find($restaurant);
---
select * from `restaurants` where `restaurants`.`id` = '1' limit 1

        } else if ($tab == 'product') {


            $foods =Food::withoutGlobalScope(\App\Scopes\RestaurantScope::class)
            ->with('category.parent')
            ->where('restaurant_id', $restaurant->id)
            ->when(isset($key) , function($q) use($key) {
                $q->where(function($q) use($key){
                    foreach ($key as $value) {
                        $q->where('name', 'like', "%{$value}%");
                    }
                });
            })
            ->latest()->paginate(config('default_pagination'));
---
select * from `food` where `restaurant_id` = 1 and (`name` like '%%') order by `created_at` desc limit 25 offset 0
select count(*) as aggregate from `food` where `restaurant_id` = 1 and (`name` like '%%')

            })
            ->cuisine($cuisine_id)
            ->type($type)->RestaurantModel($typ)->latest()->paginate(config('default_pagination'));
                $zone = is_numeric($zone_id) ? Zone::findOrFail($zone_id) : null;
---
select * from `zones` where `zones`.`id` in (2)
select `cuisines`.*, `cuisine_restaurant`.`restaurant_id` as `pivot_restaurant_id`, `cuisine_restaurant`.`cuisine_id` as `pivot_cuisine_id` from `cuisines` inner join `cuisine_restaurant` on `cuisines`.`id` = `cuisine_restaurant`.`cuisine_id` where `cuisine_restaurant`.`restaurant_id` in (1)

    public function categories($id)
    {

        $restaurant = Restaurant::findorfail($id);
        $categories = ParentCategory::with(['Foods' => function($qu){
            $qu->orderBy('sort_number');
        }])->whereHasMorph(
            'parentable',
            [Restaurant::class],
            function ($query) use ($id) {
                $query->where('parentable_id', $id);
            }
        )->get();
---
select * from `restaurants` where `restaurants`.`id` = '1' limit 1
select * from `food` where `food`.`category_id` in (1, 2, 3, 4, 5, 6) order by `sort_number` asc

    public function get_restaurants(Request $request)
    {

        $zone_ids = isset($request->zone_ids) ? (count($request->zone_ids) > 0 ? $request->zone_ids : []) : 0;
        $zone_id = $request->zone_id ??  null;
        $data = Restaurant::with('zone')->

        when($zone_ids, function($query) use($zone_ids){
            $query->whereIn('restaurants.zone_id', $zone_ids);
        })
       ->when($zone_id, function($query) use($zone_id){
            $query->where('restaurants.zone_id', $zone_id);
        })

        ->where('restaurants.name', 'like', '%'.$request->q.'%')
        ->limit(8)->get()
        ->map(function ($restaurant) {
            return [
                'id' => $restaurant->id,
                'text' => $restaurant->name . ' (' . $restaurant->zone?->name . ')',
            ];
        });
---
select * from `restaurants` where `restaurants`.`name` like '%%' limit 8
select * from `zones` where `zones`.`id` in (2)