app/Http/Controllers/Admin/ZoneController.php

    public function index(Request $request)
    {
        $key = explode(' ', $request['search'] ?? null );
        $country_id = auth('admin')->user()->country_id ;

        $zones = Zone::when(!is_null($country_id) , function($q) use($country_id){
            $q->where('country_id' , $country_id);
        })->
        withCount(['restaurants','deliverymen' , 'categories'])
        ->when(isset($key), function($query)use($key){
            $query->where( function ($q) use ($key) {
                foreach ($key as $value) {
                    $q->orWhere('name', 'like', "%{$value}%");
                }
            });
        })
        ->latest()->paginate(config('default_pagination'));
---
select count(*) as aggregate from `zones` where `country_id` is null and (`name` like '%%')

        $zone->maximum_shipping_charge = $request->maximum_shipping_charge ??null ;
        $zone->max_cod_order_amount = $request->max_cod_order_amount ?? null;
        $zone->country_id = $request->country_id ;
        $zone->save();
---
insert into `zones` (`name`, `coordinates`, `restaurant_wise_topic`, `customer_wise_topic`, `deliveryman_wise_topic`, `per_km_shipping_charge`, `minimum_shipping_charge`, `maximum_shipping_charge`, `max_cod_order_amount`, `country_id`, `updated_at`, `created_at`) values ('Amman', ST_GeomFromText('POLYGON((36.106530701354 32.006869162641, 35.976068054869 32.034813611122, 35.717889343932 32.035977778158, 35.711022888854 31.943963003731, 35.673944031432 31.86701918199, 35.926629578307 31.843690176116, 36.065331970885 31.858854701326, 36.106530701354 32.006869162641))', 0), 'zone_4_restaurant', 'zone_4_customer', 'zone_4_delivery_man', 0, 0, '', '', '6', '2024-06-27 06:10:51', '2024-06-27 06:10:51')


        if(count($data))
        {
            Translation::insert($data);
        }
        $new_data=1;
        // Toastr::success(translate('messages.zone_added_successfully'));
        $zones = Zone::withCount(['restaurants','deliverymen'])->latest()->paginate(config('default_pagination'));
---
insert into `translations` (`key`, `locale`, `translationable_id`, `translationable_type`, `value`) values ('name', 'en', 4, 'App\Models\Zone', 'Amman'), ('name', 'ar', 4, 'App\Models\Zone', 'عمان'), ('name', 'he', 4, 'App\Models\Zone', 'عمان')
select count(*) as aggregate from `zones`

    public function get_coordinates($id){
        $zone=Zone::withoutGlobalScopes()->selectRaw("*,ST_AsText(ST_Centroid(`coordinates`)) as center")->findOrFail($id);
---
select *,ST_AsText(ST_Centroid(`coordinates`)) as center from `zones` where `zones`.`id` = '4' limit 1

    public function getZonesByCountry($country_id)
    {
        //update admin country
        $admin = Admin::find(auth('admin')->id());
        $admin->country_id = $country_id ;
        $admin->save();
---
select * from `admins` where `admins`.`id` = 1 limit 1
update `admins` set `country_id` = '1', `admins`.`updated_at` = '2024-06-23 02:38:51' where `id` = 1