app/Http/Controllers/Admin/ZoneCategoryController.php

    public function categories($id)
    {

        $zone = Zone::findorfail($id);

        $RestCategories = ZoneCategory::where('zone_id' , $zone->id)->where('is_market_category' , 0)->get();
        $MarketCategories = ZoneCategory::where('zone_id' , $zone->id)->where('is_market_category' , 1)->get();
---
select * from `zones` where `zones`.`id` = '2' limit 1
select * from `zone_categories` where `zone_id` = 2 and `is_market_category` = 0
select * from `zone_categories` where `zone_id` = 2 and `is_market_category` = 1

    public function add_new_category(Request $request)
    {

        $validator = Validator::make($request->all(), [
            'name' => 'required|max:100',
            'image' => 'required',
            'zone_id' => 'required|exists:zones,id',

        ], [
            'name.required' => translate('messages.name_is_required'),
            // 'additional_documents.max' => translate('You_can_chose_max_5_files_only'),
        ]);


        $category = new ZoneCategory();
        $category->name = $request->name[array_search('default', $request->lang)];;
        $category->image = $request->has('image') ? Helpers::upload(dir:'category/',format: 'png',image: $request->file('image')) : 'def.png';
        $category->zone_id = $request->zone_id ;
        $category->is_market_category = $request->status ;
        $category->save();
---
insert into `zone_categories` (`name`, `image`, `zone_id`, `is_market_category`, `updated_at`, `created_at`) values ('Choco', '2024-06-23-6677e6bf95925.png', '2', '0', '2024-06-23 02:11:27', '2024-06-23 02:11:27')

            }
        }

        Translation::insert($data);
---
insert into `translations` (`key`, `locale`, `translationable_id`, `translationable_type`, `value`) values ('name', 'en', 6, 'App\Models\ZoneCategory', 'Choco'), ('name', 'ar', 6, 'App\Models\ZoneCategory', 'شوكولاته')

    public function status(Request $request)
    {
        $id = $request->get('id');
        $info = ZoneCategory::find($id);
---
select * from `zone_categories` where `zone_categories`.`id` is null limit 1